SM_для_EDT/src/DataProcessors/рарусОформлениеРасходаТМЦ/рарусОформлениеРасходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рарусОформлениеРасходаТМЦ</name>
  <comment>makole</comment>
</mdclass:DataProcessor>

SM_для_EDT/src/AccumulationRegisters/рарусИмуществоНаСудах/рарусИмуществоНаСудах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>рарусИмуществоНаСудах</name>
  <comment>rarus makole</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DefinedType.рарусРаспоряжение</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.рарусСтатусыИмуществаНаСудне</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SM_для_EDT/src/Enums/рарусВидыОперацийРасходаТМЦ/рарусВидыОперацийРасходаТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусВидыОперацийРасходаТМЦ</name>
  <comment>rarus makole ФТ.ИМ.01.01</comment>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзВыданного</name>
  </enumValues>
  <enumValues>
    <name>БУ</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусСтатусыИмуществаНаСудне/рарусСтатусыИмуществаНаСудне.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусСтатусыИмуществаНаСудне</name>
  <comment>rarus makole</comment>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>ВыданоВПользование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованоБУ</name>
  </enumValues>
  <enumValues>
    <name>СписаноВРегУчете</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/рарусРасходТМЦ/рарусРасходТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусРасходТМЦ</name>
  <comment>rarus makole</comment>
  <basedOn>Document.рарусИнвентаризацияТМЦ</basedOn>
  <basedOn>Document.рарусИзменениеСтатусаТМЦ</basedOn>
  <basedOn>Document.рарусЗаказКлиента</basedOn>
  <basedOn>Document.рарусЗаказНаПеремещение</basedOn>
  <registerRecords>AccumulationRegister.рарусТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.рарусИмуществоНаСудах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.рарусВидыОперацийРасходаТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.впАктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.рарусЗаказНаПеремещение</types>
      <types>DocumentRef.рарусЗаказКлиента</types>
      <types>DocumentRef.рарусИнвентаризацияТМЦ</types>
      <types>DocumentRef.впПриходТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/DataProcessors/рарусОформлениеРасходаТМЦ/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьРасход(СтруктураПараметров, РезультатОбработки, ТаблицаДляОбработки, ТаблицаНесписанных) Экспорт
	
	// В таблицах накапливаем данные для отдельных документов на каждую категорию и вид операции Расхода ТМЦ
	ТаблицаСписанияЗабаланс = Новый ТаблицаЗначений;
	ТаблицаСписанияЗабаланс.Колонки.Добавить("Номенклатура");
	ТаблицаСписанияЗабаланс.Колонки.Добавить("Количество");
	ТаблицаСписанияБУ 		= ТаблицаСписанияЗабаланс.СкопироватьКолонки();
	ТаблицаСписанияСклад 	= ТаблицаСписанияЗабаланс.СкопироватьКолонки();
	ТаблицаНесписанных		= ТаблицаСписанияЗабаланс.СкопироватьКолонки();
	СтруктураДляКатегории 	= Новый Структура("ТаблицаСписанияЗабаланс, ТаблицаСписанияБУ, ТаблицаСписанияСклад",
											ТаблицаСписанияЗабаланс, 
											ТаблицаСписанияБУ,
											ТаблицаСписанияСклад);
	СтруктураПараметров.Вставить("Склад", рарусОбщегоНазначенияСервер.СкладСудна(СтруктураПараметров.ОсновноеСудно));
	ВыборкаКатегории = ПолучитьОстаткиПоКатегориям(ТаблицаДляОбработки,, СтруктураПараметров.Склад);
	КонтролироватьОстатки = рарусИмущественныйУчетСервер.КонтролироватьОстаткиТМЦ(Новый Структура("Период, Судно", ТекущаяДатаСеанса(), СтруктураПараметров.ОсновноеСудно));
	
	Пока ВыборкаКатегории.Следующий() Цикл
		
		СтруктураДляКатегории.ТаблицаСписанияЗабаланс.Очистить();
		СтруктураДляКатегории.ТаблицаСписанияБУ.Очистить();
		СтруктураДляКатегории.ТаблицаСписанияСклад.Очистить();
		
		ВыборкаНоменклатура = ВыборкаКатегории.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			ПодготовитьТаблицыДокументовПоНоменклатуре(ТаблицаДляОбработки, ТаблицаНесписанных, СтруктураДляКатегории, ВыборкаНоменклатура, РезультатОбработки, КонтролироватьОстатки);
			
		КонецЦикла;
		
		Для Каждого КлючИЗначение из СтруктураДляКатегории Цикл
			
			Если КлючИЗначение.Значение.Количество() = 0 Тогда
				Продолжить
			КонецЕсли;

			Если КлючИЗначение.Ключ = "ТаблицаСписанияЗабаланс" Тогда
				ВидОперации = ПредопределенноеЗначение("Перечисление.рарусВидыОперацийРасходаТМЦ.ИзВыданного")
			ИначеЕсли КлючИЗначение.Ключ = "ТаблицаСписанияБУ" Тогда
				ВидОперации = ПредопределенноеЗначение("Перечисление.рарусВидыОперацийРасходаТМЦ.БУ");
			Иначе
				ВидОперации = ПредопределенноеЗначение("Перечисление.рарусВидыОперацийРасходаТМЦ.СоСклада");
			КонецЕсли;
			
			СФормироватьДокументРасхода(СтруктураПараметров, ВидОперации, КлючИЗначение.Значение, РезультатОбработки);
			
			Если РезультатОбработки.Отказ = Истина Тогда
				Возврат
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьТаблицыДокументовПоНоменклатуре(ТаблицаДляОбработки, ТаблицаНесписанных, СтруктураДляКатегории, ВыборкаНоменклатура, РезультатОбработки, КонтролироватьОстатки)
	
	СтрокиОбработки = ТаблицаДляОбработки.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНоменклатура.Номенклатура));
	// Может быть несколько строк, учтём общее количество
	Количество = 0;
	ПустойТекстОшибки = НЕ ЗначениеЗаполнено(РезультатОбработки.ТекстОшибки);
	Для каждого СтрокаНоменклатуры Из СтрокиОбработки Цикл
		Количество = Количество + СтрокаНоменклатуры.Количество
	КонецЦикла;

	Если Количество = 0 Тогда
		СтрокаНесписанных = ТаблицаНесписанных.Добавить();
		СтрокаНесписанных.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		СтрокаНесписанных.Количество = 0;
		РезультатОбработки.ТекстОшибки = РезультатОбработки.ТекстОшибки + ?(ПустойТекстОшибки, "", Символы.ПС) + СтрШаблон("По номенклатуре %1 не указано количество", Строка(ВыборкаНоменклатура.Номенклатура));
		Возврат;
	КонецЕсли;

	ВыборкаОстатки = ВыборкаНоменклатура.Выбрать();

	Пока ВыборкаОстатки.Следующий()
		И Количество > 0 Цикл
		
		Если ВыборкаОстатки.Статус = ПредопределенноеЗначение("Перечисление.рарусСтатусыИмуществаНаСудне.ВыданоВПользование") Тогда
			СтрокаСписания = СтруктураДляКатегории.ТаблицаСписанияЗабаланс.Добавить()
		ИначеЕсли ВыборкаОстатки.Статус = ПредопределенноеЗначение("Перечисление.рарусСтатусыИмуществаНаСудне.ОприходованоБУ") Тогда
			СтрокаСписания = СтруктураДляКатегории.ТаблицаСписанияБУ.Добавить()
		ИначеЕсли ВыборкаОстатки.Статус = ПредопределенноеЗначение("Перечисление.рарусСтатусыИмуществаНаСудне.НаСкладе") Тогда
			СтрокаСписания = СтруктураДляКатегории.ТаблицаСписанияСклад.Добавить()
		Иначе 
			// Нет остатков, номенклатура в документ не попадает
			Прервать;
		КонецЕсли;
		
		СтрокаСписания.Номенклатура = ВыборкаОстатки.Номенклатура;
		СтрокаСписания.Количество = Мин(Количество, ВыборкаОстатки.КоличествоОстаток);
		
		Количество = Количество - СтрокаСписания.Количество;
		
	КонецЦикла;

	Если Количество > 0 И НЕ КонтролироватьОстатки Тогда
		// При отключенном контроле остатков всю нехватающую к списанию номенклатуру отнесём на склад
		СтрокаСписания = СтруктураДляКатегории.ТаблицаСписанияСклад.Добавить();
		СтрокаСписания.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		СтрокаСписания.Количество = Количество;
		СтруктураДляКатегории.ТаблицаСписанияСклад.Свернуть("Номенклатура", "Количество");
		РезультатОбработки.ТекстОшибки = РезультатОбработки.ТекстОшибки + ?(ПустойТекстОшибки, "", Символы.ПС) + СтрШаблон("По номенклатуре %1 не хватает %2 ед. для списания со склада", Строка(ВыборкаНоменклатура.Номенклатура), Количество);
	ИначеЕсли Количество > 0 Тогда
		СтрокаНесписанных = ТаблицаНесписанных.Добавить();
		СтрокаНесписанных.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		СтрокаНесписанных.Количество = Количество;
		РезультатОбработки.ТекстОшибки = РезультатОбработки.ТекстОшибки + ?(ПустойТекстОшибки, "", Символы.ПС) + СтрШаблон("По номенклатуре %1 не хватает %2 ед. для списания со склада", Строка(ВыборкаНоменклатура.Номенклатура), Количество);
	КонецЕсли;
			
КонецПроцедуры

// Возвращает выборку остатков ТМЦ в имущественном учете, отсортированную для формирования списания с итогами по Категории и Номенклатуре 
//
// Параметры:
//  ТаблицаНоменклатуры  - ТаблицаЗначений - таблица с обязательной типизированной колонкой Номенклатура
//                 по которой будут получены остатки
//  Период  - Дата, Неопределено - период получения остатков
//  Склад  - СправочникСсылка.Склады, Неопределено - склад судна, по которому получаем остатки
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса   - выборка с полями Номенклатура, Категория, Качество, Статус, КоличествоОстаток
//
Функция ПолучитьОстаткиПоКатегориям(ТаблицаНоменклатуры, Период = Неопределено, Склад = Неопределено)
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса()
	КонецЕсли;
	
	Если Склад = Неопределено Тогда
		Склад = рарусОбщегоНазначенияСервер.СкладСудна(рарусОбщегоНазначенияСервер.ОсновноеСудно())
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ИсходнаяТаблица
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	рарусИмуществоНаСудахОстатки.Номенклатура КАК Номенклатура,
		|	рарусИмуществоНаСудахОстатки.Статус КАК Статус,
		|	рарусИмуществоНаСудахОстатки.Склад КАК Склад,
		|	рарусИмуществоНаСудахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.рарусИмуществоНаСудах.Остатки(
		|			&Период,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_ИсходнаяТаблица.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТ_ИсходнаяТаблица КАК ВТ_ИсходнаяТаблица)
		|				И Склад = &Склад
		|				И Статус В (ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.ВыданоВПользование), ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.ОприходованоБУ), ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.НаСкладе))) КАК рарусИмуществоНаСудахОстатки
		|ГДЕ
		|	рарусИмуществоНаСудахОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спрНоменклатура.Ссылка КАК Номенклатура,
		|	спрНоменклатура.Категория КАК Категория,
		|	спрНоменклатура.Качество КАК Качество,
		|	ЕСТЬNULL(ВТ_Остатки.Статус, НЕОПРЕДЕЛЕНО) КАК Статус,
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ВТ_Остатки.Статус = ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.ВыданоВПользование)
		|			ТОГДА 1
		|		КОГДА ВТ_Остатки.Статус = ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.ОприходованоБУ)
		|			ТОГДА 2
		|		КОГДА ВТ_Остатки.Статус = ЗНАЧЕНИЕ(Перечисление.рарусСтатусыИмуществаНаСудне.НаСкладе)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	ВТ_ИсходнаяТаблица КАК ВТ_ИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_ИсходнаяТаблица.Номенклатура = ВТ_Остатки.Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО ВТ_ИсходнаяТаблица.Номенклатура = спрНоменклатура.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок
		|ИТОГИ ПО
		|	Категория,
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Процедура СФормироватьДокументРасхода(СтруктураПараметров, ВидОперации, ТаблицаДанных, РезультатОбработки)
	
	ДокументРасхода = Документы.рарусРасходТМЦ.СоздатьДокумент();
	ДокументРасхода.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(ДокументРасхода, СтруктураПараметров, "Склад, Комментарий");
	ДокументРасхода.ВидОперации = ВидОперации;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если Строка.Количество > 0 Тогда
			СтрокаТЧ = ДокументРасхода.ТМЦ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ДокументРасхода.Записать(РежимЗаписиДокумента.Проведение);
		рарусИмущественныйУчетВызовСервера.УстановитьСтатусЗарегистрированоКОтправке(ДокументРасхода.Ссылка);
	Исключение
		РезультатОбработки.Отказ = Истина;
		РезультатОбработки.ТекстОшибки = РезультатОбработки.ТекстОшибки + Символы.ПС + ОписаниеОшибки();
		РезультатОбработки.ЗаголовокОшибки = "Не удалось записать документ";
	КонецПопытки;
	
	//Создание файла//
	Если СтруктураПараметров.ЕстьПриложенныеФайлы Тогда
		Если Не РезультатОбработки.Отказ Тогда
			Для Каждого ПриложенныйФайл Из СтруктураПараметров.СведенияОФайлах Цикл
				ПараметрыФайла = Новый Структура;
				ПараметрыФайла.Вставить("Автор", ПараметрыСеанса.АвторизованныйПользователь);
				ПараметрыФайла.Вставить("ВладелецФайлов", ДокументРасхода.Ссылка);
				ПараметрыФайла.Вставить("ИмяБезРасширения", ПриложенныйФайл.СведенияОФайле.ИмяБезРасширения);
				ПараметрыФайла.Вставить("РасширениеБезТочки", ПриложенныйФайл.СведенияОФайле.РасширениеБезТочки);
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ТекущаяУниверсальнаяДата());
				ПараметрыФайла.Вставить("ГруппаФайлов", Неопределено);
				ПараметрыФайла.Вставить("Служебный", Ложь);
				РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ПриложенныйФайл.СведенияОФайле.АдресВременногоХранилищаФайла);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
